## Uber Dataset - Exploratory Data Analysis(EDA)

#### Step-1-Importing the Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

Getting the current Library details - To pull the datset

In [2]:
import os
print(os.getcwd())
files = os.listdir(os.curdir)
files

C:\Users\Manokaran\OneDrive\AI - Working_Exercises\Working_Exercises

['.ipynb_checkpoints',
 'Kaggle_uber.csv.zip',
 'uber.csv',
 'uberdrive.csv',
 'Uber_Data_EDA.ipynb']

In [3]:
#data_uber_kag = pd.read_csv("C:\\Users\\Manokaran\\OneDrive\\AI - Working_Exercises\\Working_Exercises\\uber.csv")
#data_uber.head()

In [4]:
data_uber_source = pd.read_csv("C:\\Users\\Manokaran\\OneDrive\\AI - Working_Exercises\\Working_Exercises\\uberdrive.csv")
data_uber_source.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [5]:
print(data_uber_source.shape)
print(data_uber_source.size)

(1156, 7)
8092

In [6]:
data_uber_source.describe()

              MILES
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [7]:
# Data type of the data 
print(data_uber_source.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   START_DATE  1156 non-null   object
 1   END_DATE    1155 non-null   object
 2   CATEGORY    1155 non-null   object
 3   START       1155 non-null   object
 4   STOP        1155 non-null   object
 5   MILES       1156 non-null   float64
 6   PURPOSE     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB
None

In [8]:
# Finding the Null values in the data 
data_uber_source.isnull().sum()

START_DATE      0
END_DATE        1
CATEGORY        1
START           1
STOP            1
MILES           0
PURPOSE       503
dtype: int64

In [9]:
data_uber_source.columns

Index(['START_DATE', 'END_DATE', 'CATEGORY', 'START', 'STOP', 'MILES',
       'PURPOSE'],
      dtype='object')

In [11]:
data_uber_source['CATEGORY'].unique()

array(['Business', 'Personal', nan], dtype=object)

###  Dropping the records - Which has Null or NAN values

In [12]:
data_uber = data_uber_source.dropna()
data_uber.head()

,START_DATE,END_DATE,CATEGORY,START,STOP,MILES,PURPOSE
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
5,1/6/2016 17:15,1/6/2016 17:19,Business,West Palm Beach,West Palm Beach,4.3,Meal/Entertain

In [13]:
print(data_uber.shape)
print(data_uber.size)

(653, 7)
4571

In [14]:
# Finding the Null values in the data 
data_uber.isnull().sum()

START_DATE    0
END_DATE      0
CATEGORY      0
START         0
STOP          0
MILES         0
PURPOSE       0
dtype: int64

In [15]:
data_uber.describe()

            MILES
count  653.000000
mean    11.196325
std     22.986429
min      0.500000
25%      3.200000
50%      6.400000
75%     10.400000
max    310.300000

### Lets explore the data parameter wise - 

1.Destination - (starting and stopping)

2.Time - (hour of the day, day of week, month of year)

3.Categories

4.Purpose 

5.Grouping two parameters to get more insights